# 4sq

In [4]:
import getpass

import requests
import json
import pandas as pd

fsq3IBz8M5CTm58GImdCWcCYGDNh5OmA6s8Ue4/YPN7SNe8=

## Token

In [5]:
token = getpass.getpass(prompt='Enter your token: ')

Enter your token: ········

## NEW YORK

In [6]:
new_york = ["40.69517", "-73.93230"]  # LAT / LON

###### category

In [7]:
def query_from_frousquare_category (lon, lat, radius, category, limit):

    url = f"https://api.foursquare.com/v3/places/search?ll={lon}%2C{lat}&radius={radius}&categories={category}&sort=DISTANCE&limit={limit}"
    headers = {
        "accept": "application/json",
        "Authorization": token
    }

    response = requests.get(url, headers=headers)
    
    return response

###### query

In [8]:
def query_from_frousquare (query, lon, lat, radius, limit):
    
    url = f"https://api.foursquare.com/v3/places/search?query={query}&ll={lon}%2C{lat}&radius={radius}&sort=DISTANCE&limit={limit}"

    headers = {
        "accept": "application/json",
        "Authorization": token
    }

    response = requests.get(url, headers=headers)
    
    return response

###### df

In [9]:
def something_near_somewhere (element):
    
    name = element["name"]
    address = element["location"]["formatted_address"]
    lat = element["geocodes"]["main"]["latitude"]
    lon = element["geocodes"]["main"]["longitude"]
    category_id = element["categories"][0]["id"]
    category = element["categories"][0]["name"]

    dict_ = {"name": name, "address":address, "lat": lat, "lon": lon, "category_id" : category_id, "category": category}
    
    return dict_

### Preschool

In [13]:
response = query_from_frousquare_category (new_york[0], new_york[1], 5000, 12056, 5)
response = response.json()

In [14]:
new_lst_1 = []

for i in response["results"]:
    new_lst_1.append(something_near_somewhere(i))

In [15]:
df1 = pd.DataFrame(new_lst_1)
df1

,name,address,lat,lon,category_id,category
0,Verny Daycare,"992 Greene Ave, Brooklyn, NY 11221",40.690851,-73.927928,11025,Child Care Service
1,The Katmint,"545 Quincy St, Brooklyn, NY 11221",40.688597,-73.937656,12056,Preschool
2,Ms. Taylor s House Pre School,"180 Malcolm X Blvd, Brooklyn, NY 11221",40.687289,-73.930104,11025,Child Care Service
3,Brightside Academy,"844 Dekalb Ave, Brooklyn, NY 11221",40.692249,-73.942245,11025,Child Care Service
4,Brooklyn Community Daycare Center,"202 Vernon Ave, Brooklyn, NY 11206",40.695122,-73.943664,12056,Preschool

### Elementary school

In [16]:
response = query_from_frousquare_category (new_york[0], new_york[1], 5000,12057 , 5)
response = response.json()

In [17]:
new_lst_2 = []

for i in response["results"]:
    new_lst_2.append(something_near_somewhere(i))

In [18]:
df2 = pd.DataFrame(new_lst_2)
df2

,name,address,lat,lon,category_id,category
0,Bedford Stuyvesant New Beginnings Charter School,"82 Lewis Ave (Hart Street), Brooklyn, NY 11206",40.694634,-73.937712,12058,Elementary School
1,Brighter Choice Community School,"280 Hart St, New York, NY 11206",40.693854,-73.940693,12058,Elementary School
2,Success Academy Bed-Stuy 2,"211 Throop Ave, Brooklyn, NY 11206",40.697662,-73.943456,12058,Elementary School
3,PS 262 El Hajj Malik El Shabazz Elementary School,"500 Macon St (btwn Macon & Macdonough), Brookl...",40.683090,-73.929858,12058,Elementary School
4,Brooklyn Brownstone School,"272 MacDonough St, Brooklyn, NY 11233",40.681695,-73.935692,12058,Elementary School

### High school

In [19]:
response = query_from_frousquare_category (new_york[0], new_york[1], 10000,12059 , 5)
response = response.json()

In [20]:
new_lst_3 = []

for i in response["results"]:
    new_lst_3.append(something_near_somewhere(i))

In [21]:
df3 = pd.DataFrame(new_lst_3)
df3

,name,address,lat,lon,category_id,category
0,Coy L Cox School,"820 Hancock St, Brooklyn, NY 11233",40.685549,-73.922536,12059,High School
1,Boys and Girls High School,"1700 Fulton St, Brooklyn, NY 11213",40.678946,-73.931619,12059,High School
2,Culture Shock,"42 Maujer St, Brooklyn, NY 11206",40.710235,-73.949174,12059,High School
3,School,"76 Rutledge St, Brooklyn, NY 11249",40.700588,-73.959013,12059,High School
4,Ronald Edmonds Learning Center Ii,"430 Howard Ave, Brooklyn, NY 11233",40.673061,-73.919840,12059,High School

### Playground park

In [22]:
response = query_from_frousquare_category (new_york[0], new_york[1], 10000,16037 , 5)
response = response.json()

In [23]:
new_lst_4 = []

for i in response["results"]:
    new_lst_4.append(something_near_somewhere(i))

In [24]:
df4 = pd.DataFrame(new_lst_4)
df4

,name,address,lat,lon,category_id,category
0,Green Central Knoll Playground,"Central Ave, Brooklyn, NY 11206",40.701872,-73.933189,16037,Playground
1,Maria Hernandez Park,"301 Suydam St (btwn Starr & Suydam St), Brookl...",40.702979,-73.923981,16037,Playground
2,Herbert Von King Park,670 Lafayette Ave (Between Greene Ave & Lafaye...,40.689817,-73.946471,16036,Picnic Area
3,Irving Square Park,"Knickerbocker Ave (Halsey St), Brooklyn, NY 11207",40.692802,-73.909201,16037,Playground
4,Tiger playground,"Brooklyn, NY 11207",40.687808,-73.910496,16037,Playground

### Airports

In [25]:
response = query_from_frousquare_category (new_york[0], new_york[1], 15000, 19031 , 10)
response = response.json()

In [26]:
new_lst_5 = []

for i in response["results"]:
    new_lst_5.append(something_near_somewhere(i))

In [27]:
df5 = pd.DataFrame(new_lst_5)
df5

,name,address,lat,lon,category_id,category
0,www.cheapOone.com,"288 Crown St, Brooklyn, NY 11225",40.666098,-73.950532,19036,Airport Service
1,JetBlue,"2701 Queens Plz N, Long Island City, NY 11101",40.750810,-73.938634,19036,Airport Service
2,BLADE Lounge,"499 E 34th St, New York, NY 10016",40.742080,-73.972494,19036,Airport Service
3,Bio Cube,"120 Wall St, New York, NY 10005",40.704868,-74.006174,19036,Airport Service
4,Jets.Com,"401 Broadway, New York, NY 10013",40.718823,-74.002668,19036,Airport Service
5,Saker Aviation Service,"20 South St, New York, NY 10004",40.701550,-74.009185,19036,Airport Service
6,Sentinel Jet,"14 Wall St, New York, NY 10005",40.707545,-74.010819,19036,Airport Service
7,Bell Helicopter,"119 W 17th St, New York, NY 10011",40.739870,-73.996382,19036,Airport Service
8,JetBlue Airways,"90 Park Ave, New York, NY 10016",40.750745,-73.979296,19036,Airport Service
9,Alpha Priority,"350 5th Ave, New York, NY 10118",40.748381,-73.984925,19036,Airport Service

### Train stations

In [28]:
response = query_from_frousquare_category (new_york[0], new_york[1], 15000, 19047 , 5)
response = response.json()

In [29]:
new_lst_6 = []

for i in response["results"]:
    new_lst_6.append(something_near_somewhere(i))

In [30]:
df6 = pd.DataFrame(new_lst_6)
df6

,name,address,lat,lon,category_id,category
0,Lirr Atlantic Terminal,"New York, NY 11213",40.678423,-73.941150,19047,Rail Station
1,LIRR - Nostrand Avenue Station,1287 Atlantic Ave (btwn Nostrand & New York Av...,40.678672,-73.947962,19047,Rail Station
2,Wilson Avenue Station,"Chauncey St, New York, NY 11207",40.688985,-73.904739,19047,Rail Station
3,LIRR - East New York Station,Atlantic Ave (btw Snediker Ave & Van Sinderen ...,40.676612,-73.903753,19047,Rail Station
4,Franklin Avenue – Botanic Garden,"Franklin Avenue, Brooklyn, NY 11225",40.670631,-73.958380,19047,Rail Station

### Vegan restaurants

In [31]:
response = query_from_frousquare_category (new_york[0], new_york[1], 10000, 13377 , 5)
response = response.json()

In [32]:
new_lst_7 = []

for i in response["results"]:
    new_lst_7.append(something_near_somewhere(i))

In [33]:
df7 = pd.DataFrame(new_lst_7)
df7

,name,address,lat,lon,category_id,category
0,Happyfun Hideaway,"1211 Myrtle Ave (Bushwick Ave), Brooklyn, NY 1...",40.697492,-73.931626,13010,Dive Bar
1,Chez Alex,"72 Ralph Ave (Madison St), Brooklyn, NY 11221",40.687563,-73.923834,13002,Bakery
2,Pine Box Rock Shop,"12 Grattan St (btwn Bogart St & Morgan Ave), B...",40.705388,-73.932756,10039,Music Venue
3,Bunna Cafe,"1084 Flushing Ave (at Porter Ave), Brooklyn, N...",40.704924,-73.927895,13067,African Restaurant
4,Dun-Well Doughnuts,222 Montrose Ave (btwn Bushwick Ave & Humboldt...,40.707398,-73.940294,13377,Vegan and Vegetarian Restaurant

### More vegan restaurants

In [34]:
response = query_from_frousquare ("vegan", new_york[0], new_york[1], 10000, 5)
response = response.json()

In [35]:
new_lst_8 = []

for i in response["results"]:
    new_lst_8.append(something_near_somewhere(i))

In [36]:
df8 = pd.DataFrame(new_lst_8)
df8

,name,address,lat,lon,category_id,category
0,Vegan Market,"1140 Myrtle Ave (btwn Broadway & Ditmars St), ...",40.696872,-73.934657,13377,Vegan and Vegetarian Restaurant
1,Amituofo Vegan Cuisine,"19 Bogart St, Brooklyn, NY 11206",40.703811,-73.933263,13065,Restaurant
2,Vegan Shop Up,"12 Grattan St (Bogart Street), Brooklyn, NY 11206",40.705283,-73.932664,13003,Bar
3,Ethiopian Vegan Restaurant,"1084 Flushing Ave, Brooklyn, NY 11237",40.704924,-73.927895,17057,Food and Beverage Retail
4,Bunna Cafe,"1084 Flushing Ave (at Porter Ave), Brooklyn, N...",40.704924,-73.927895,13067,African Restaurant

### Pubs

In [37]:
response = query_from_frousquare_category (new_york[0], new_york[1], 5000, 13018 , 5)
response = response.json()

In [38]:
new_lst_9 = []

for i in response["results"]:
    new_lst_9.append(something_near_somewhere(i))

In [39]:
df9 = pd.DataFrame(new_lst_9)
df9

,name,address,lat,lon,category_id,category
0,The Clonard,"506 Grand St, Brooklyn, NY 11211",40.710782,-73.950897,13018,Pub
1,The Flying Fox Tavern,"678 Woodward Ave (Gates Ave), Ridgewood, NY 11385",40.705010,-73.906300,13018,Pub
2,Hartley's,"14 Putnam Ave, Brooklyn, NY 11238",40.682628,-73.961286,13018,Pub
3,Banter,"132 Havemeyer St (at S 1st St), Brooklyn, NY 1...",40.712170,-73.957453,13018,Pub
4,Putnam's Pub & Cooker,"419 Myrtle Ave (Clinton Ave.), Brooklyn, NY 11205",40.693255,-73.969069,13018,Pub

### Night club

In [40]:
response = query_from_frousquare_category (new_york[0], new_york[1], 15000, 10032 , 5)
response = response.json()

In [41]:
new_lst_10 = []

for i in response["results"]:
    new_lst_10.append(something_near_somewhere(i))

In [42]:
df10 = pd.DataFrame(new_lst_10)
df10

,name,address,lat,lon,category_id,category
0,Bossa Nova Civic Club,"1271 Myrtle Ave (at Hart St), Brooklyn, NY 11221",40.698020,-73.927982,10032,Night Club
1,The Love Shack - A Little Palace in Brooklyn,"161 Stockholm St, Brooklyn, NY 11237",40.699555,-73.922979,10032,Night Club
2,Rubulad,"338 Flushing Ave (Classon Ave and Taaffe Pl.),...",40.698151,-73.961449,10032,Night Club
3,House of Yes,"2 Wyckoff Ave (at Jefferson St), Brooklyn, NY ...",40.706764,-73.923601,10032,Night Club
4,Bed-Vyne Cocktail,"305 Halsey St (at Throop Ave), Brooklyn, NY 11216",40.683020,-73.940584,10032,Night Club

### Pet Grooming Service

In [43]:
response = query_from_frousquare_category (new_york[0], new_york[1], 5000, 11134 , 5)
response = response.json()

In [44]:
new_lst_11 = []

for i in response["results"]:
    new_lst_11.append(something_near_somewhere(i))

In [45]:
df11 = pd.DataFrame(new_lst_11)
df11

,name,address,lat,lon,category_id,category
0,Mae's Grooming Services,"1131 Broadway, Brooklyn, NY 11221",40.693784,-73.929130,11134,Pet Grooming Service
1,Bushwick Bark,"175 Knickerbocker Ave (Flushing Ave), Brooklyn...",40.704081,-73.927165,11134,Pet Grooming Service
2,Roro's Pet Styling,"317 Knickerbocker Ave, Brooklyn, NY 11237",40.701556,-73.922749,11134,Pet Grooming Service
3,Zen Animals,"233 Malcolm X Blvd, Brooklyn, NY 11233",40.684777,-73.929268,11134,Pet Grooming Service
4,Bushwick Bark on Irving,"181 Irving Ave, Brooklyn, NY 11237",40.702182,-73.919457,11134,Pet Grooming Service

### Dog parks

In [46]:
response = query_from_frousquare_category (new_york[0], new_york[1], 5000, 16033 , 5)
response = response.json()

In [47]:
new_lst_12 = []

for i in response["results"]:
    new_lst_12.append(something_near_somewhere(i))

In [48]:
df12 = pd.DataFrame(new_lst_12)
df12

,name,address,lat,lon,category_id,category
0,Maria Hernandez Park Dog Run,"Irving Ave (at Willoughby Ave), Brooklyn, NY 1...",40.703914,-73.923275,16033,Dog Park
1,Herbert Von King Park Dog Run,"Marcy Ave (at Lafayette Ave), Brooklyn, NY 11216",40.689833,-73.947911,16033,Dog Park
2,Fulton Park Dog Run,"Fulton St (Stuyvesant Ave), Brooklyn, NY 11233",40.679746,-73.931955,16033,Dog Park
3,Sternberg Park Dog Run,"Leonard St (Montrose Avenue and Boerum St), Br...",40.706206,-73.946575,16033,Dog Park
4,Chicken Hut,"169 Spencer St, Brooklyn, NY 11205",40.693371,-73.954721,16033,Dog Park

### Starbucks

In [49]:
response = query_from_frousquare ("starbucks", new_york[0], new_york[1], 5000, 5)
response = response.json()

In [50]:
new_lst_13 = []

for i in response["results"]:
    new_lst_13.append(something_near_somewhere(i))

In [51]:
df13 = pd.DataFrame(new_lst_13)
df13

,name,address,lat,lon,category_id,category
0,Starbucks,"774 Broadway (Marcus Garvey Blvd), New York, N...",40.699934,-73.941143,13035,Coffee Shop
1,Starbucks,"329 Wyckoff Ave (at Palmetto St), Ridgewood, N...",40.699811,-73.911253,13035,Coffee Shop
2,Starbucks,"405-409 Union Avenue, Brooklyn, NY 11211",40.712545,-73.951532,13035,Coffee Shop
3,Starbucks,"325 Lafayette Ave, New York, NY 11238",40.688897,-73.962706,13035,Coffee Shop
4,Starbucks,"154 N 7th St (btwn Bedford Ave & Berry St), Br...",40.717972,-73.958288,13035,Coffee Shop

### Basketball

In [52]:
response = query_from_frousquare_category (new_york[0], new_york[1], 10000, 18006 , 5)
response = response.json()

In [53]:
new_lst_14 = []

for i in response["results"]:
    new_lst_14.append(something_near_somewhere(i))

In [54]:
df14 = pd.DataFrame(new_lst_14)
df14

,name,address,lat,lon,category_id,category
0,Kosciuszko st payground nyc,"1156 Broadway (KOsciuszko St), Brooklyn, NY 11221",40.693214,-73.928279,18008,Basketball Court
1,Sholes Basketball Court,"Manhattan Ave (Manhattan Ave), Brooklyn, NY 11206",40.708989,-73.945329,18008,Basketball Court
2,SWISH Academy,"251 Clifton Pl, Brooklyn, NY 11216",40.689037,-73.953464,18008,Basketball Court
3,Cooper Park Basketball Courts,"341 Morgan Ave, Brooklyn, NY 11211",40.715763,-73.936031,18008,Basketball Court
4,McCarren Park Basketball Courts,"558 Driggs Ave, Brooklyn, NY 11211",40.717093,-73.956901,18008,Basketball Court

### Design

In [55]:
response = query_from_frousquare_category (new_york[0], new_york[1], 15000, 11030 , 5)
response = response.json()

In [56]:
new_lst_15 = []

for i in response["results"]:
    new_lst_15.append(something_near_somewhere(i))

In [57]:
df15 = pd.DataFrame(new_lst_15)
df15

,name,address,lat,lon,category_id,category
0,Timo Weiland Studio,"1123 Broadway (West 25th Street), Brooklyn, NY...",40.693889,-73.929221,11030,Design Studio
1,Ra's Studio,"63 Woodward Ave, Ridgewood, NY 11385",40.713183,-73.919436,11030,Design Studio
2,Grey Line Map,"87 Richardson St (Leonard), Brooklyn, NY 11211",40.718677,-73.948101,11030,Design Studio
3,SMAKK Studios,"109 S 5th St (Bedford Ave.), Brooklyn, NY 11211",40.711674,-73.963892,11030,Design Studio
4,NYC Laser Cut,"63 Flushing Ave (Unit 195, Building 280, Suite...",40.698211,-73.975239,11030,Design Studio

# CONCATENATE

In [69]:
df_new_york = pd.concat([df1, 
                              df2, 
                              df3, 
                              df4, 
                              df5, 
                              df6, 
                              df7, 
                              df8, 
                              df9, 
                              df10, 
                              df11, 
                              df12, 
                              df13, 
                              df14, 
                              df15])

In [70]:
df_new_york = df_new_york.reset_index(drop=True)

In [71]:
df_new_york

,name,address,lat,lon,category_id,category
0,Verny Daycare,"992 Greene Ave, Brooklyn, NY 11221",40.690851,-73.927928,11025,Child Care Service
1,The Katmint,"545 Quincy St, Brooklyn, NY 11221",40.688597,-73.937656,12056,Preschool
2,Ms. Taylor s House Pre School,"180 Malcolm X Blvd, Brooklyn, NY 11221",40.687289,-73.930104,11025,Child Care Service
3,Brightside Academy,"844 Dekalb Ave, Brooklyn, NY 11221",40.692249,-73.942245,11025,Child Care Service
4,Brooklyn Community Daycare Center,"202 Vernon Ave, Brooklyn, NY 11206",40.695122,-73.943664,12056,Preschool
...,...,...,...,...,...,...
75,Timo Weiland Studio,"1123 Broadway (West 25th Street), Brooklyn, NY...",40.693889,-73.929221,11030,Design Studio
76,Ra's Studio,"63 Woodward Ave, Ridgewood, NY 11385",40.713183,-73.919436,11030,Design Studio
77,Grey Line Map,"87 Richardson St (Leonard), Brooklyn, NY 11211",40.718677,-73.948101,11030,Design Studio
78,SMAKK Studios,"109 S 5th St (Bedford Ave.), Brooklyn, NY 11211",40.711674,-73.963892,11030,Design Studio
79,NYC Laser Cut,"63 Flushing Ave (Unit 195, Building 280, Suite...",40.698211,-73.975239,11030,Design Studio

# SAVE DF

In [72]:
#df_new_york.to_csv("../data/new_york.csv", index=False)